ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M480/device/StdDriver/m480_spim.c
    SPIM_DBGMSG("SPIM_SetQuadEnable - Flash ID is 0x%x\n", idBuf[0]);

    switch (idBuf[0]) {
        case MFGID_WINBOND:                      /* Winbond SPI flash  */
            SPIM_ReadStatusRegister(&dataBuf[0], 1UL, u32NBit);
            SPIM_ReadStatusRegister2(&dataBuf[1], 1UL, u32NBit);
            SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);
            if (isEn) {
                dataBuf[1] |= SR2_QE;
            } else {
                dataBuf[1] &= ~SR2_QE;
            }

            spim_set_write_enable(1, u32NBit);   /* Write Enable.    */
            SPIM_WriteStatusRegister2(dataBuf, sizeof(dataBuf), u32NBit);
            spim_wait_write_done(u32NBit);

            SPIM_ReadStatusRegister(&dataBuf[0], 1UL, u32NBit);
            SPIM_ReadStatusRegister2(&dataBuf[1], 1UL, u32NBit);
            SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);
            break;

        case MFGID_MXIC:                         /* MXIC SPI flash.  */
        case MFGID_EON:
        case MFGID_ISSI:                         /* ISSI SPI flash.  */
            spim_set_write_enable(1, u32NBit);   /* Write Enable.    */
            dataBuf[0] = isEn ? SR_QE : 0U;
            SPIM_WriteStatusRegister(dataBuf, sizeof(dataBuf), u32NBit);
            spim_wait_write_done(u32NBit);
            break;

        case MFGID_SPANSION:
            spim_enable_spansion_quad_mode(isEn);
            break;

        default:
            break;
    }
}

/**
  * @brief      Enter/exit QPI mode.
  * @param      isEn        Enable/disable.
  * @return     None.
  */
static void spim_eon_set_qpi_mode(int isEn)
{
    uint8_t cmdBuf[1];                           /* 1-byte command.  */

    uint8_t status[1];
    SPIM_ReadStatusRegister(status, sizeof(status), 1UL);
    SPIM_DBGMSG("Status: 0x%x\n", status[0]);

    if (isEn) {                                  /* Assume in SPI mode. */
        cmdBuf[0] = OPCODE_ENQPI;

        SPIM_SET_SS_EN(1);                      /* CS activated.    */
        SwitchNBitOutput(1UL);
        spim_write(cmdBuf, sizeof(cmdBuf));
        SPIM_SET_SS_EN(0);                      /* CS deactivated.  */
    } else {                                     /* Assume in QPI mode. */
        cmdBuf[0] = OPCODE_EXQPI;

        SPIM_SET_SS_EN(1);                      /* CS activated.    */
        SwitchNBitOutput(4UL);
        spim_write(cmdBuf, sizeof(cmdBuf));
        SPIM_SET_SS_EN(0);                      /* CS deactivated.  */
    }

    SPIM_ReadStatusRegister(status, sizeof(status), 1UL);
    SPIM_DBGMSG("Status: 0x%x\n", status[0]);
}


static void SPIM_SPANSION_4Bytes_Enable(int isEn, uint32_t u32NBit)
{
    uint8_t cmdBuf[2];
    uint8_t dataBuf[1];

    cmdBuf[0] = OPCODE_BRRD;
    SPIM_SET_SS_EN(1);                          /* CS activated.    */
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, 1UL);
    SwitchNBitInput(1UL);
    spim_read(dataBuf, 1UL);
    SPIM_SET_SS_EN(0);                          /* CS deactivated.  */

    SPIM_DBGMSG("Bank Address register= 0x%x\n", dataBuf[0]);

    cmdBuf[0] =  OPCODE_BRWR;

    if (isEn) {
        cmdBuf[1] = dataBuf[0] | 0x80U;          /* set EXTADD       */
    } else {
        cmdBuf[1] = dataBuf[0] & ~0x80U;         /* clear EXTADD     */
    }

    SPIM_SET_SS_EN(1);                          /* CS activated.    */
    SwitchNBitOutput(1UL);
    spim_write(cmdBuf, 2UL);
    SPIM_SET_SS_EN(0);                          /* CS deactivated.  */
}

/** @cond HIDDEN_SYMBOLS */

/**
  * @brief      Query 4-byte address mode enabled or not.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     0: 4-byte address mode disabled. 1: 4-byte address mode enabled.
  */
int SPIM_Is4ByteModeEnable(uint32_t u32NBit)
{
    int  isEn = 0;
    int  isSupt = 0;
    uint8_t  idBuf[3];
    uint8_t  dataBuf[1];

    SPIM_ReadJedecId(idBuf, sizeof(idBuf), u32NBit);

    /* Based on Flash size, check if 4-byte address mode is supported.  */
    switch (idBuf[0]) {
        case MFGID_WINBOND:
        case MFGID_MXIC:
        case MFGID_EON:
            isSupt = (idBuf[2] < 0x19U) ? 0L : 1L;
            break;

        case MFGID_ISSI:
            isSupt = (idBuf[2] < 0x49U) ? 0L : 1L;
            break;

        default:
            break;
    }

    if (isSupt != 0) {
        if (idBuf[0] == MFGID_WINBOND) {
            /* Winbond SPI flash. */
            SPIM_ReadStatusRegister3(dataBuf, sizeof(dataBuf), u32NBit);
            isEn = !!(dataBuf[0] & SR3_ADR);
        } else if ((idBuf[0] == MFGID_MXIC) || (idBuf[0] == MFGID_EON)) {
            /* MXIC/EON SPI flash. */
            SPIM_ReadSecurityRegister(dataBuf, sizeof(dataBuf), u32NBit);
            isEn = !!(dataBuf[0] & SCUR_4BYTE);
        }
    }

    return isEn;
}

/** @endcond HIDDEN_SYMBOLS  */


/**
  * @brief      Enter/Exit 4-byte address mode.
  * @param      isEn        Enable/disable.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     0           success
  *             -1          failed
  */
int SPIM_Enable_4Bytes_Mode(int isEn, uint32_t u32NBit)
{
    int  isSupt = 0L, ret = -1;
    uint8_t idBuf[3];
    uint8_t cmdBuf[1];                           /* 1-byte Enter/Exit 4-Byte Mode command. */

    SPIM_ReadJedecId(idBuf, sizeof(idBuf), u32NBit);

    /* Based on Flash size, check if 4-byte address mode is supported. */
    switch (idBuf[0]) {
        case MFGID_WINBOND:
        case MFGID_MXIC:
        case MFGID_EON:
            isSupt = (idBuf[2] < 0x19U) ? 0L : 1L;
            break;

        case MFGID_ISSI:
            isSupt = (idBuf[2] < 0x49U) ? 0L : 1L;
            break;

        case MFGID_SPANSION:
            SPIM_SPANSION_4Bytes_Enable(isEn, u32NBit);
            isSupt = 1L;
            ret = 0L;
            break;

        default:
            break;
    }

    if ((isSupt) && (idBuf[0] != MFGID_SPANSION)) {
        cmdBuf[0] = isEn ? OPCODE_EN4B : OPCODE_EX4B;

        SPIM_SET_SS_EN(1);                      /* CS activated.    */
        SwitchNBitOutput(u32NBit);
        spim_write(cmdBuf, sizeof(cmdBuf));
        SPIM_SET_SS_EN(0);                      /* CS deactivated.  */

